{"text":"Holiday Countdown\n\nDear Tana, \n\nIf you missed the airfare sale in September, here is another \nopportunity to save! Make your holiday travel plans now. \nThe airlines have kicked off another fare sale lasting the first \nfew days of October. Click here for details. \nhttp://travelocity1.m0.net/m/s.asp?H2247185751X873483\n\nIf you're looking for destination ideas, Travelocity.com Insider \ncan help you decide where on Earth to go this holiday season. Like \nto ski or snowboard? Our travel editors compare California ski \ndestinations. Looking to escape the cold? We've got lots of \ninformation about winter travel to Los Angeles, the Caribbean, and \nmore. So whether you think \"home for the holidays means\" shopping \nin New York City or lying on a beach, Travelocity.com Insider can \nhelp you plan your holiday getaway. \n\n\nIn this issue: \nFeatured This Month\n\u0001\u0007??UNIVERSAL Orlando Halloween Horror Nights\n\u0001\u0007??California\n\u0001\u0007??Los Angeles\n\u0001\u0007??Bahamas\n\u0001\u0007??Washington, D.C.\n\u0001\u0007??Travelocity's Been There\n\u0001\u0007??Today's Real Deals\nDestination Guides\n\u0001\u0007??New York City\n\u0001\u0007??Jerusalem\nSite Features\n\u0001\u0007??Explore Travelocity Magazine!\n\u0001\u0007??Travelocity.com Launches New Business Site\n\u0001\u0007??Need to Find a Gift for the Traveler in Your Family?\nTravelers Network\n\u0001\u0007??Message Boards\n\u0001\u0007??Tips & Advice \n\u0001\u0007??Travel Tip \nSpecial Offer\n\u0001\u0007??Aspen/Snowmass Special Offer!\n\n\n***FEATURED THIS MONTH***\n\nPlan the Ultimate Frightful Adventure Package!\nHoliday madness will soon be upon us. Before it hits, be sure to \nkick off the holiday season with a visit to UNIVERSAL Orlando \nHalloween Horror Nights--the maddest annual Halloween party of \nall time! Book Now!\nhttp://travelocity1.m0.net/m/s.asp?H2247185751X871293\n\nCalifornia\nFor many families, December, with its long break from school, means \nskiing. What better way to bring the family together for the \nholidays than with a skiing or snowboarding vacation? California's\nLake Tahoe region offers snow galore and lodgings for every budget. \nGet the inside scoop as one of our travel experts evaluates the \nbewildering array of downhill resorts in the Tahoe area. \n\nCalifornia & California's: \nhttp://travelocity1.m0.net/m/s.asp?H2247185751X871294\nSkiing: http://travelocity1.m0.net/m/s.asp?H2247185751X871295\nTahoe Area: http://travelocity1.m0.net/m/s.asp?H2247185751X871296\n\nLos Angeles\nIf escaping the cold is your idea of the perfect holiday getaway, \nconsider sunny Los Angeles--the wonderfully surreal sight of Santa \nand his reindeer suspended high above Rodeo Drive is worth the \nprice of airfare. Get your shopping done under warm blue skies and \nforget the cold back home. Celebrate Christmas Southern-California \nstyle by viewing the annual Christmas Boat Parade of Lights. And \nspeaking of parades, be sure to stick around to see the annual New \nYear's Day Tournament of Roses Parade, the colorful kick-off to the \nRose Bowl football game. \n\nLos Angeles: http://travelocity1.m0.net/m/s.asp?H2247185751X871297\nTournament of Roses Parade: \nhttp://travelocity1.m0.net/m/s.asp?H2247185751X871373\n\nBahamas\nAnother fantastic warm-weather getaway destination is the Bahamas. \nTrue to its British heritage, you'll find that Christmas and \nHanukkah are relatively low-key, non-commercial events on the \nislands. The big party here starts the day after Christmas, with a \nunique celebration known as Junkanoo. Parades, music, masks, and \ncostumes are all part of this exuberant week long festival (thought \nto be derived from slave celebrations in the 1700s). Your family \nwill be sure to enjoy this event, when the islands really \ncut loose. \n\nBahamas: http://travelocity1.m0.net/m/s.asp?H2247185751X871298\nJunkanoo: http://travelocity1.m0.net/m/s.asp?H2247185751X871299\n\nWashington, D.C.\nOur nation's capital, with its historic sights and scores of \nmuseums, is a fantastic place to visit any time of year. But it's \nespecially magnificent in December when holiday decorations are out \nin all their glory. Don't miss the President lighting the national \nChristmas tree, accompanied by carolers, a nativity scene, and a \ngiant Yule log. Another impressive holiday sight (one you'll have \nto arrive early for!) is a candle-lit tour of the White House. For \nthree days after Christmas, the President opens up his home for an \nevening tour of his holiday decorations. \n\nWashington, D.C.: \nhttp://travelocity1.m0.net/m/s.asp?H2247185751X871300\nScores of museums: \nhttp://travelocity1.m0.net/m/s.asp?H2247185751X871301\n\nTravelocity's Been There\nWe've already been there...and you can go there too! BeenThere! \nfrom Travelocity.com features real stories by real people (our own \nhardworking, travel-loving employees) to great destinations! \nWhether it's relaxing at the Grove Park Inn in Asheville, North \nCarolina you're interested in or rafting through the Great Smokies\nin Tennessee. Read about our adventures then make your plans to go \nthere too. \n\nTravelocity's Been There: \nhttp://travelocity1.m0.net/m/s.asp?H2247185751X873249\nRelaxing at the Grove Park Inn: \nhttp://travelocity1.m0.net/m/s.asp?H2247185751X873250\nRafting through the Great Smokies: \nhttp://travelocity1.m0.net/m/s.asp?H2247185751X873251\nRead: http://travelocity1.m0.net/m/s.asp?H2247185751X873252\n\n\n***TODAY'S REAL DEALS***\n\nCelebrate the Holidays with Holland America from $899!\nGive the gift of travel this holiday season! While perfume and ties \nare nice, a seven-night cruise to the Panama Canal or the Caribbean \nwith Holland America is sure to be more memorable. Sailings \nstarting at just $899 (not including taxes and fees) are filling up \nfast, so start planning your Christmas or New Year's vacation \ntoday. Book Now! \nhttp://travelocity1.m0.net/m/s.asp?H2247185751X871303\n\nRing in the New Year with Norwegian Cruise Line from $799!\nPut on your party hat and break out the champagne--Norwegian Cruise \nLine wants to take you into the New Year in style! For as little \nas $799 per person, including port charges and taxes, you and your \nloved ones can journey deep into the Southern Caribbean for seven \nnights, exploring a host of beautiful ports that most people only \ndream about. Book Now! \nhttp://travelocity1.m0.net/m/s.asp?H2247185751X871304\n\nSki for Less and Earn 10,000 AAdvantagec Bonus Miles!\nEarn 10,000 Bonus Miles when you book a minimum five-night American \nAirlines Vacations package on select hotel properties in Beaver \nCreek, Breckenridge, Keystone, or Vail! To take advantage of this \nDeal, you must book by November 30, 2000 for travel November 15, \n2000 through February 28, 2001. Book Now! \nhttp://travelocity1.m0.net/m/s.asp?H2247185751X871305\n\nCaribbean Island SALE! Up to $150 Off!\nBreak away from the winter blues and bask in the exotic warmth of \nthe Caribbean for LESS! Book a 5-night Delta Vacations package and \nSAVE $150 or receive $75 off when you book a 2-night package at \nparticipating properties. The longer you stay, the larger the \nsavings! To qualify, you must travel between September 26, 2000 \nand January 31, 2001 and purchase the Travel Protection Plan by \nOctober 31, 2000. Book Now! Book Now! \nhttp://travelocity1.m0.net/m/s.asp?H2247185751X871306\n\n\n***DESTINATION GUIDES***\n\nNew York City\nFew cities get into the holiday spirit like New York City. Kicking \noff the season with its classic Thanksgiving parade, the city goes \non to host the lighting of the world's largest menorah and the \nfamous Rockefeller Center Christmas tree. And of course the City's \nTimes Square is practically synonymous with New Year's Eve. Stores \nsuch FAO Schwarz, Saks Fifth Avenue, and Tiffany's get into the \nspirit with lavish window and in-store displays--you'd be hard \npressed to find a better city for Christmas shopping. \nhttp://travelocity1.m0.net/m/s.asp?H2247185751X871307\n\nJerusalem\nAn entirely different holiday experience can be found in Jerusalem, \na city held sacred by followers of three major religions. Less \ntouristed in December than Bethlehem, Jerusalem maintains an air of \ndignity and solemnity it's had since King David walked its streets. \nHome to such holy attractions as the birthplace of John the \nBaptist, the Via Dolorosa, and the El Aksa Mosque, Jerusalem is a \ngreat place to get in touch with the real meaning of the holidays. \nhttp://travelocity1.m0.net/m/s.asp?H2247185751X871308\n\n\n***SITE FEATURES***\n\nExplore Travelocity Magazine!\nExplore exotic destinations and discover intriguing travel information \nand special deals. Don't miss one issue of Travelocity \nMagazine--subscribe now! \nhttp://travelocity1.m0.net/m/s.asp?H2247185751X871309\n\nTravelocity.com Launches New Business Site\nA site tailored to the special needs of our business travelers. \nThe Business Travel Center offers you access to the same low fares \nyou find on Travelocity.com but with all your favorite \nbusiness-planning and reservation tools in one convenient location. \nEasily book trips you take often through our \"Repeat a Trip\" \nfunctionality or set up a corporate account so all of your \ntravelers can utilize one corporate credit card. \nhttp://travelocity1.m0.net/m/s.asp?H2247185751X871310\n\nNeed to Find a Gift for the Traveler in Your Family? \nAt our travel store you'll find a broad range of quality luggage \nand travel accessories. From computer cases to cosmetic cases you \nwill find accessories to help you travel comfortably and safely, \nas well as luggage that's right for the road warrior or the \nvacationer. Don't shop till you drop--visit \nstore.travelocity.com today. \nhttp://travelocity1.m0.net/m/s.asp?H2247185751X871311\n\n\n***TRAVELERS NETWORK***\n\nMessage Boards\nMaking plans for the holidays? Maybe it is time to visit those \nrelatives in Washington, D.C. Or perhaps you should use the time \noff to escape to the Florida Keys. Having any worries about \ntraveling with the family? Wherever this season takes you, check \nout what others have to say on Message Boards. \n\nMessage Boards: http://travelocity1.m0.net/m/s.asp?H2247185751X871315\nWashington, D.C.: http://travelocity1.m0.net/m/s.asp?H2247185751X871312\nFlorida Keys: http://travelocity1.m0.net/m/s.asp?H2247185751X871313\nTraveling with the family: \nhttp://travelocity1.m0.net/m/s.asp?H2247185751X871314\n\n\n***TIPS & ADVICE***\n\n\u0001\u0007??Checking In on Time\nhttp://travelocity1.m0.net/m/s.asp?H2247185751X871316\n\n\u0001\u0007??What to Do If You Get Bumped\nhttp://travelocity1.m0.net/m/s.asp?H2247185751X871317\n\n\u0001\u0007??Tips for Finding Low Fares\nhttp://travelocity1.m0.net/m/s.asp?H2247185751X871318\n\n\u0001\u0007??Making Family Travel More Enjoyable\nhttp://travelocity1.m0.net/m/s.asp?H2247185751X871348\n\n\n***TRAVEL TIP***\n\nAvoid the Holiday Rush\nThough it will be nearly impossible to avoid the rush altogether, \nwe can provide some helpful advice on how to make your holiday \ntravels as stress-free as possible. Read our tips on planning for \nthe upcoming season. \nhttp://travelocity1.m0.net/m/s.asp?H2247185751X871349\n\n\n***SPECIAL OFFER***\n\nSki and Win! Special Offer from Aspen/Snowmass!\nAspen/Snowmass lift tickets as low as $39 per day when you purchase \nby December 1. No blackout dates. Buy on-line at \nwww.aspensnowmass.com by October 15, and you could win a free trip \nto Aspen/Snowmass! \nhttp://travelocity1.m0.net/m/s.asp?H2247185751X871358\n\n\n********** NEWS FROM OUR SPONSORS **********\n\nVisit Florida\nClick www.flausa.com and take a virtual visit to sunny Florida and \norder your free Official Florida Vacation Guide. Or call \n1-888-7-FLA-USA. Then turn off your computer, and visit us \nfor real! \nhttp://travelocity1.m0.net/m/s.asp?H2247185751X871362\n\n* * * \n\nChase Manhattan\nTraveling Abroad? To get foreign currency before you leave, just \nvisit www.currency-to-go.com or call 1-800-CHASE84, anytime day \nor night. \nhttp://travelocity1.m0.net/m/s.asp?H2247185751X871364\n\n::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::\n:::::::::::::\n\n\nHappy Travels! \n\nThe Travelocity.com Team \nGo Virtually Anywhere! \nwww.travelocity.com\n\nUNSUBSCRIBE \nWhen you registered at Travelocity or Preview Travel, you agreed to \nreceive e-mail. If you would like to change your subscription \npreferences or if you received this message in error, please \nclick below: \nhttp://travelocity1.m0.net/m/u/tty/t2.asp?e=TANA.JONES%40enron.com\n\nFORGOT YOUR PASSWORD? \nPassword look-up--follow this link and we'll help you retrieve \nyour password: \nhttp://travelocity1.m0.net/m/s.asp?H2247185751X746568\n\nHOW DO I UPDATE MY E-MAIL? \nYou may update your e-mail address within Your Account Preferences. \nSimply click on \"Your Account\" at the top of the home page and log in. \nhttp://travelocity1.m0.net/m/s.asp?H2247185751X747392\n\nTravelocityc and Travelocity.com are trademarks of Travelocity.com LP \nand Sabrec is a trademark of an affiliate of Sabre Inc., 2000 \nTravelocity.com LP. All rights reserved. WB/WS \n#242 CST#2050374-40 \n\n\n\n\n#36775\n\n\n","headers":{"message-id":"<22100434.1075847114723.JavaMail.evans@thyme>","date":"Wed, 4 Oct 2000 22:29:00 -0700 (PDT)","from":"insider@travelocity.m0.net","to":"tana.jones@enron.com","subject":"Travelocity's October Issue of \"The Insider\" Newsletter","mime-version":"1.0","content-type":"text/plain; charset=ANSI_X3.4-1968","content-transfer-encoding":"quoted-printable","x-from":"\"Travelocity.com\" <insider@travelocity.m0.net>","x-to":"TANA.JONES@enron.com","x-cc":"","x-bcc":"","x-folder":"\\Tanya_Jones_Dec2000\\Notes Folders\\Notes inbox","x-origin":"JONES-T","x-filename":"tjones.nsf"},"subject":"Travelocity's October Issue of \"The Insider\" Newsletter","messageId":"22100434.1075847114723.JavaMail.evans@thyme","priority":"normal","from":[{"address":"insider@travelocity.m0.net","name":""}],"to":[{"address":"tana.jones@enron.com","name":""}],"date":"2000-10-05T05:29:00.000Z"}