{"text":"\n---------------------- Forwarded by Tracy Geaccone/GPGFIN/Enron on 02/05/2001 02:26 PM ---------------------------\n\n\n\"Jack Hurst\" <hurst@intur.net> on 01/24/2001 12:05:08 PM\nTo:\t\"Wayne Guidry\" <Guidry_Wayne@emc.com>, <Tracy.Geaccone@enron.com>, \"Lou and Kathleen Dionne\" <lkdionne@olypen.com>, \"Hurst, Julie A\" <Hurst.Julie@emeryworld.com>, \"Dianne Costa\" <gdsown@airmail.net>\ncc:\t \n\nSubject:\tFw: Fw: Travel Advice from the Texas Tourism Bureau\n\n\n\n----- Original Message -----\nFrom: \"Jim Ross\" <jtross@attglobal.net>\nTo: <rwbradford@bigfoot.com>; <bobdockerty@aol.com>; <CJRN1@aol.com>;\n<clay@ditch.com>; <rmanasco@lawmed.com>; <farnold_us@yahoo.com>;\n<hgilmore@701brazos.com>; <garyhoov@msn.com>; <creeclu@nts-online.net>;\n<john_p_pryor@fleet.com>; <kds.riptorn@juno.com>; <toksr@iopener.net>;\n<jkoehn@austin.rr.com>; <john.mackey@wholefoods.com>; <gmcgee@texas.net>;\n<david@encotechengineering.com>; <David.Oneil@PetroCosm.com>;\n<paulvic@cheerful.com>; <areagan@inetport.com>; <rschofie@email.usps.gov>;\n<brider@lumbermensinv.com>; <jridge@wcc.net>; <DLR@COMPASSBNK.COM>;\n<sandcomm@texas.net>; <ssinger@roadrunner.com>; <terrymoynahan@hotmail.com>;\n<Steve.Thorington@OceanEnergy.com>; <steve.tousey@walgreens.com>;\n<zack.church@walgreens.com>; <mattharris1@uswest.net>\nSent: Wednesday, January 24, 2001 11:38 AM\nSubject: Fwd: Fw: Travel Advice from the Texas Tourism Bureau\n\n\n\n>         Travel Bulletin from the Texas Tourism Bureau\n\n\n>The new Texas White House in Crawford, Texas, will soon be drawing a\n>numberof people to that area and other areas of the south, including many\n>who are not used to southern hospitality, like Yankee, liberal reporters.\n>They might find useful the following travel advice issued by the Texas\n> > Tourism Bureau to all visiting Northerners and Northeastern Urbanites:\n>\n> > >> >1)    Don't order filet mignon or pasta primavera at Waffle House.\n>It's\n> > >> >just a diner. They serve breakfast 24 hours a day.  Let them cook\n> > >something\n> > >> >they know.  If you confuse them, they'll kick your ass.\n>\n> > >> >2)    Don't laugh at our Southern names (Merleen, Bodie, Bubby,\nBobby\n> > >Ray, Tammy Lynn, Billy Joe, Sissy, Clovis, etc.).  Or we will just HAVE\nto\n> > >kick your ass.\n> > >> >\n> > >> >3)    Don't order a bottle of pop or a can of soda down here. Down\n>here it's called Coke. Nobody gives a damn whether it's Pepsi, RC, Dr.\n> > Pepper, 7-Up or whatever - it's still a Coke.  Accept it.  Doing\n> otherwise can\n> > >lead to an ass kicking.\n> > >> >\n> > >> >4)    We know our heritage.  Most of us are more literate than you\n>(e.g. Welty, Williams, Faulkner). We are also better educated and generally\n>a lot nicer. Don't refer to us as a bunch of hillbillies, or ee'll kick\n>your ass.\n> > >> >\n> > >> >5)    We have plenty of business sense (e.g., Fred Smith of Fed Ex,\n> > >Turner Broadcasting, MCI WorldCom, MTV, Netscape, Dell computers).\n> Naturally, we do sometimes, have small\n>lapses in judgment (e.g., Carter, Duke, Barnes, Clinton).  We don't\n>care if you think we are dumb.  We are not dumb enough to let someone move\nto\n> > our state in order to run for the Senate. If someone tried to do that,\nwe\n> > >would CERTAINLY kick their ass.\n> > >> >\n> > >> >6)    Don't laugh at our Civil War monuments.  If Lee had listened\nto\n> > >> >Longstreet and flanked Meade at Gettysburg instead of sending\nPickett\n>up the middle, you'd be paying taxes to Richmond instead of Washington.\n>\n> > >> >\n> > >> >7)    We are fully aware of how hot the weather is in August, so\n> shut the hell\n> > >up. Just spend your money and get the hell out of here, or we'll kick\n> your ass.\n> > >> >\n> > >> >8)    Don't order wheat toast at Cracker Barrel. Everyone will\n>instantly know that you're a Yankee. Eat your biscuits like God\nintended-with\n> > >gravy. And don't put sugar on your grits, or we'll kick your ass.\n> > >> >\n> > >> >9)    Don't talk about how much better things are at home because we\n> > know better.  Many of us have visited Northern hell-holes like Detroit,\n> > >Chicago, and DC, and we have the scars and the notches on our pistols\n> to prove it.  If you don't like it here,\n> >Delta is ready when you are.  Move your ass on home before it gets\n> kicked up between your shoulders and you have to take off your shirt to\nshit!\n> > >> >\n> > >> >10)    Yes, we know how to speak proper English. We talk this way\n> > because we don't want to sound like you.  We don't care if you don't\n>understand what we are saying.  All other Southerners understand what we\nare\n> > saying,and that's all that matters.  Now, go away and leave us alone, or\n>we'llkick your ass.\n> > >> >\n> > >> >11)    Don't complain that the South is dirty and polluted.  None of\n>OUR lakes or rivers have caught fire recently.  If you whine about OUR\n> > scenic beauty, we'll kick your ass all the way back to Boston Harbor.\n> > >> >\n> > >> >12)    Don't ridicule our Southern manners.  We say sir and ma'am.\nWe\n> > >hold doors open for others. We offer our seats to old folks because\nsuch\n> > >things are expected of civilized people.  Behave yourselves around our\n> sweet\n> > >> >little grey-haired grandmothers or they'll kick some manners into\nyour\n> > >ass just like they did ours.\n> > >> >\n> > >> >13)    So you think we're quaint or losers because most of us live\nin\n> > the countryside?  That's because we have enough sense to not live in\n>filthy, smelly, crime-infested cesspools like New York or Baltimore. Make\nfun\n>of our fresh air, and we'll kick your sorry ass.\n> > >> >\n> > >> >14) Nothing in California is Southern, so if you come down here,\ndon't\n> > >> >think you're one of us just because you say you're from Southern\n> > >> >California. Your Mexicans didn't invent low riders, ours did.  And\nthe\n> > >food is Tex Mex.  It isn't Cal Mex.  You haven't contributed anything\nto\n> > >South so don't try to take or we'll kick your ass.\n> > >> >\n> > >> >15)    Last, but not least, DO NOT DARE to come down here and tell\nus\n> > how to barbecue.  This will get your ass shot (right after it is\nkicked).\n> >You're lucky we let you come down here at all.  Criticize our\n>barbeque, and you will go home in a pine box.  Minus your ass.\n> > >> >\n> > >> >_________________________________________________________________\n> > >> >Get your FREE download of MSN Explorer at http://explorer.msn.com\n> > >> >\n> > >> >\n> > >> >\n> > >>\n> > >\n> > >\n> >\n> > \n> >\n\n\n\n\n","headers":{"message-id":"<14905572.1075859055200.JavaMail.evans@thyme>","date":"Mon, 5 Feb 2001 18:19:00 -0800 (PST)","from":"tracy.geaccone@enron.com","to":"jon.trevelise@enron.com","subject":"Fw: Fw: Travel Advice from the Texas Tourism Bureau","mime-version":"1.0","content-type":"text/plain; charset=ANSI_X3.4-1968","content-transfer-encoding":"quoted-printable","x-from":"Tracy Geaccone","x-to":"Jon Trevelise <Jon Trevelise/Houston/Eott@Eott>","x-cc":"","x-bcc":"","x-folder":"\\TGEACCO (Non-Privileged)\\Geaccone, Tracy\\'Sent Mail","x-origin":"Geaccone-T","x-filename":"TGEACCO (Non-Privileged).pst"},"subject":"Fw: Fw: Travel Advice from the Texas Tourism Bureau","messageId":"14905572.1075859055200.JavaMail.evans@thyme","priority":"normal","from":[{"address":"tracy.geaccone@enron.com","name":""}],"to":[{"address":"jon.trevelise@enron.com","name":""}],"date":"2001-02-06T02:19:00.000Z"}