{"text":"Transredes Oil Spills\n Oruru- the Bolivian Superintendence of Hydrocarbons fined Transredes \n$114,000 for failing to conduct proper maintenance to the OSSA-2 pipeline \nresulting in \nthe January 30,2000 oil release. \nThe  Parotani and Chorety river oil spills have been cleaned up.  At Chorety \nthe river was open to normal use.  Drinking water is no longer being \ndelivered to the \ncommunities since the river water has passed drinking water quality \nanalytical tests.  Bolivian regulatory agency visited the Parotani site and \nfound additional \ncontamination.  A crew was sent to clean up the newly found contamination.  \nTransredes at the request of the Bolivian Forestry Department planted 350 \ntrees in\n this area. \n\nHouston Non-Attainment Study - Marc Phillips is putting together information \non the economic impact of the proposed Houston non-attainment regulations on \nthe Enron methanol plant for the Business Coalition for Clean Air (BCCA) \neconomic study. The information will be submitted to the BCCA consultant by \nmid-September. The reciprocating engines and reformer at the methanol plant \nwill be required to be controlled in 2003 and 2004.\n\n\nList of International Environmental Emergency Responders  D Ronkanein \nconducted a telephone and  internet search.    Most responders identified\nwere USA based. This list will be reviewed with other Enron entities for \nfinal selection to enter into a service agreements with qualified emergency \nresponse\ncompanies. \n\nTransredes  EHS Organization - Henry Van and Greg Marino met with Peter \nWeidler to discuss approaches for assessing the EHS management system \nfor Transredes. \n\n\nENA - Honey Lake (California) Power Facility- an employee was burned in a \nflash fire ,presumably caused by wood chip dust ignited by a electric spark, \nwhile monitoring the hopper loading operation.  Scott Watson is assisting \nplant management in the investigation and with CalOSHA visits to the facility.\n\nLagos Emergency Power Plant - the environmental impact assessment  (EIA) \nprocess begins in 2 weeks. A waiver from Nigeria was granted to begin \nwork on power barges now - while EIA is under development.  Expect EIA \ncompletion this fall. Nine  barges are being refurbished one at a time on \nsite and \nwill be put into service as the refurbishing is completed.  Water injection \nis required to reduce NOx to conform to World Bank standards.  The water \ntreatment \nplant will completed by about the time that the 7th barge is place into \nservice.  Then the 8th and 9th and the already operating barges will receive \nwater injection.\n  As a result of negotiations with Nigeria the barges will use natural gas to \nfuel the generators at a  new site immediately adjacent to an existing power \nplant.  \n\nMetgas Pipeline - Joe Kolb reviewed and provided comments to Paul Perisho on \nthe draft environmental management  plan (EMP \n\nENEL, Nicaragua -  Mike Fuentes completed the site visits for the \nenvironmental due diligence this week.  An executive summary and preliminary \ncost estimate is expected early next week.\n\nAnnual Report - The mark up draft is ready for review. Photos were not \nacceptable and waiting for Ken Lay signature the chairman statement. A  photo \nsession for internal, operations and field  EHS subjects scheduled for \nTuesday.  The web version of the report (without recently added photos) will \nbe ready for intranet posting by mid week. When the additional photos have \nbeen inserted, a new report will be posted.  ","headers":{"message-id":"<11167364.1075846341183.JavaMail.evans@thyme>","date":"Fri, 11 Aug 2000 00:47:00 -0700 (PDT)","from":"michael.terraso@enron.com","to":"steven.kean@enron.com","subject":"weekly report","cc":"maureen.mcvicker@enron.com","mime-version":"1.0","content-type":"text/plain; charset=us-ascii","content-transfer-encoding":"7bit","bcc":"maureen.mcvicker@enron.com","x-from":"Michael Terraso","x-to":"Steven Kean","x-cc":"Maureen McVicker","x-bcc":"","x-folder":"\\Steven_Kean_Dec2000_1\\Notes Folders\\Environmental issues","x-origin":"KEAN-S","x-filename":"skean.nsf"},"subject":"weekly report","messageId":"11167364.1075846341183.JavaMail.evans@thyme","priority":"normal","from":[{"address":"michael.terraso@enron.com","name":""}],"to":[{"address":"steven.kean@enron.com","name":""}],"cc":[{"address":"maureen.mcvicker@enron.com","name":""}],"bcc":[{"address":"maureen.mcvicker@enron.com","name":""}],"date":"2000-08-11T07:47:00.000Z"}