{"text":"Ron,\n\nThanks for forwarding the DJ article.\n\nI believe that the proposed DSTAR delay is neither surprising nor\nunreasonable.  It was always ridiculous to think that the DSTAR Board\nwould be able to put togethers a complete FERC filing by 12/29/00, so\nthe 3-month delay on the tariff filing is OK.  The Board seems VERY\ncommitted to making that filing.\n\nAs to the start-up date: it was always ridiciulous to believe that the\nentire software and hardware system (new EMS, all market software, etc.)\ncould be put into place by 12/01.  The 12/02 date is, in my opinion,\nboth aggressive and achievable.\n\nOne thing to keep in mind as to the FERC filing: DSTAR already exists.\nDSTAR is operated by an independent Board, not by the transmission\nowners. That's already a big improvement over the other would-be RTOs.\n(On the other hand, the transmission owners have not yet agreed to sign\nonto DSTAR by signing a TCA... but I believe that this will happen.\nWhat is CRITICAL is for FERC to respond to the 10/16/99 RTO filings by\nDEMANDING that the final RTO filings include RTO authority over ALL\nFERC-jurisdictional sevices, including interconnection at every voltage\nlevel.  If FERC does this, the utilities will fall in line.  On the\nother hand, if FERC doesn't take a hard line, there will be big debates\nand we may end up with sham RTOs.)\n\nAnother thing to keep in mind (as to implementation): DSTAR's plan is to\nconsolidate control areas (from about six down to one).  This requires\nmore in the way of implementation effort than those RTOs which propose\nto allow existing control areas to continue to exist.\n\nCarl\n____________________\n\nRonald Carroll wrote:\n>\n> Subject: DJ Desert STAR -2: Sees Need To Delay Start Up One Year\n> Date: Wed, 20 Dec 2000 07:27:23 -0600\n> From: \"Tracey Bradley\" <tbradley@bracepatt.com>\n> CC: \"Paul Fox\" <pfox@bracepatt.com>,\n>      \"Ronald Carroll\" <rcarroll@bracepatt.com>\n>\n> DJ Desert STAR -2: Sees Need To Delay Start Up One Year\n> Copyright , 2000 Dow Jones & Company, Inc.\n>\n> The six FERC jurisdictional utilities included in Desert STAR are: Arizona \nPublic Service Co., a unit of Pinnacle West Capital Corp. (PNW); El Paso \nElectric Co. (EE); Public Service Co. of New Mexico (PNM); Tucson Electric \nPower, a subsidiary of UniSource Energy Corp. (UNS); Public Service Co. of \nColorado, a unit of Xcel Energy Inc. (XEL); and Texas-New Mexico Power Co., \nnow privately held.\n>\n> Raezer said the board decided last week that the group isn't prepared to \nmake the filing at this time.\n>\n>      While FERC may not be pleased with the delay, \"we believe it is better \nto have a good filing that everyone agrees with than a bunch of pieces of a \nfiling,\" Raezer said.\n>\n>      To help the stakeholders move forward on the grid price issue, Raezer \nsaid Desert STAR's transmission owners have agreed to meet to try to come up \nwith a rate proposal to present to the other parties.\n>\n>      \"Folks realize at some point we've got to make a decision that not \neveryone will be happy with,\" Raezer said.\n>\n>      Establishing a rate design has been difficult for Desert STAR members \nbecause half the transmission facilities in the region are owned by federal \npower marketing agencies, tax-exempt utilities and cooperatives that aren't \nsubject to FERC jurisdiction, Raezer said.\n>\n>      And current rates differ dramatically, according to a draft letter \nfrom Desert STAR to FERC.\n>\n>      However, the jurisdictional utilities and the Salt River Project \nAgricultural Improvement and Power District have made a transmission rate \ndesign proposal \"that requires further development and discussion,\" according \nto the draft letter.\n>\n>      Although FERC set a Dec. 15, 2001, startup date for these independent \norganizations to take control of the nation's high-voltage grid under Order \n2000, Desert STAR said it will need another year to acquire and test \ninformation system sofware and hardware and to train operators and market \nparticipants.\n>\n>      Raezer said he has heard that other RTO groups have expressed similar \nrequests for more time to become operational with the FERC staff.\n>\n>      \"What the commission will say, we don't know,\" Raezer said.\n>\n>      The Desert STAR board also heard from stakeholders on a number of \nissues it had hoped to resolve at its November meeting.\n>\n>      Raezer said the board agreed to revisit some issues if alternative \nproposals from all stakeholders are made.\n>\n>      \"It's like peeling an onion,\" said Raezer. \"You make one decision and \nfour or five questions come up.\"\n>\n>      Desert STAR's October filing said the unresovled issues. like pricing, \nare critical \"if the participation of the non-jurisdictinoal transmission \nowners is to be achieved.\"\n>\n>      Separating control of the nation's electric grid from the companies \nthat own generation is viewed as critical in the shift to a competitive \nelectric market.\n>\n>      Those Desert STAR transmission owners not under FERC control include: \nArizona Electric Power Cooperative, Salt River Project, Plains Electric \nGenerating and Transmission Cooperative of New Mexico and a large number of \nwater and irrigation districts and municipal utilities.\n>\n>      Desert STAR has been in formation since early 1997.\n>\n>      -By Eileen O'Grady, Dow Jones Newswires; 713-547-9213; \nmailto:eileen.ogrady@dowjones.com\n>\n>      (END) Dow Jones Newswires 19-12-00\n>\n>      2237GMT","headers":{"message-id":"<26215099.1075843768896.JavaMail.evans@thyme>","date":"Wed, 20 Dec 2000 00:39:00 -0800 (PST)","from":"cfi1@tca-us.com","to":"rcarroll@bracepatt.com","subject":"Re: Fwd: DJ Desert STAR -2: Sees Need To Delay Start Up One Year","cc":"acomnes@enron.com, christi.l.nicolay@enron.com, jdasovic@enron.com, jsteffe@enron.com, mary.hain@enron.com, smara@enron.com, ellen@tca-us.com","mime-version":"1.0","content-type":"text/plain; charset=us-ascii","content-transfer-encoding":"7bit","bcc":"acomnes@enron.com, christi.l.nicolay@enron.com, jdasovic@enron.com, jsteffe@enron.com, mary.hain@enron.com, smara@enron.com, ellen@tca-us.com","x-from":"Carl Imparato <cfi1@tca-us.com>","x-to":"Ronald Carroll <rcarroll@bracepatt.com>","x-cc":"acomnes@enron.com, Christi.L.Nicolay@enron.com, jdasovic@enron.com, jsteffe@enron.com, mary.hain@enron.com, smara@enron.com, ellen@tca-us.com","x-bcc":"","x-folder":"\\Jeff_Dasovich_June2001\\Notes Folders\\Notes inbox","x-origin":"DASOVICH-J","x-filename":"jdasovic.nsf"},"subject":"Re: Fwd: DJ Desert STAR -2: Sees Need To Delay Start Up One Year","messageId":"26215099.1075843768896.JavaMail.evans@thyme","priority":"normal","from":[{"address":"cfi1@tca-us.com","name":""}],"to":[{"address":"rcarroll@bracepatt.com","name":""}],"cc":[{"address":"acomnes@enron.com","name":""},{"address":"christi.l.nicolay@enron.com","name":""},{"address":"jdasovic@enron.com","name":""},{"address":"jsteffe@enron.com","name":""},{"address":"mary.hain@enron.com","name":""},{"address":"smara@enron.com","name":""},{"address":"ellen@tca-us.com","name":""}],"bcc":[{"address":"acomnes@enron.com","name":""},{"address":"christi.l.nicolay@enron.com","name":""},{"address":"jdasovic@enron.com","name":""},{"address":"jsteffe@enron.com","name":""},{"address":"mary.hain@enron.com","name":""},{"address":"smara@enron.com","name":""},{"address":"ellen@tca-us.com","name":""}],"date":"2000-12-20T08:39:00.000Z"}