{"text":"Sarah:\nWhat a mess this is.  I need your advice on what I should do.  I was told \nthat the only way that I can play on the Rice team is to either play with a \n3.5 man or not to play on my Tuesday night league.  Bill tells me that there \nare no 3.5 men available to add to our roster.  Is that true?  This is really \na difficult choice for me because I really enjoy playing on the Tuesday night \nteam and i still feel that we have a chance to advance further.  What do you \nthink I should do?\n\n\nCarol St. Clair\nEB 3889\n713-853-3989 (Phone)\n713-646-3393 (Fax)\ncarol.st.clair@enron.com\n\n\n\n\tLOUDERDUCK@aol.com\n\t06/07/2001 01:41 PM\n\t\t \n\t\t To: <Carol.St.Clair@enron.com>\n\t\t cc: \n\t\t Subject: Re: Misc\n\n\nHi Carol--I bet your ears have been burning for a couple of days!  This is \nthe part of tennis that I really don't like.  I've had numerous email \nconversations with the person who originated the email to Cheryl Hultquist.  \nHer original email to Cheryl was meant to be an inquiry, not a protest.  One \nof her concerns was that, if our team did make it to a play-off situation, \nand it was determined at that time that you should be a 4.5, then we would \nhave to forfeit all games that you played in for the entire season.  This \nevidently happened to her team two years ago.  (I think she's rationalizing \nafter-the-fact.)\n\nYou probably know that this person--that lodged the \"protest\"--is Betsie \nHollis.  She's my women's team captain.  I've called her on the carpet about \nthis...and let her know that by trying to hurt Bill Hunt's team, she is \nhurting me, too.  She did try to withdraw her \"protest,\" but Cheryl had \nevidently already taken action.  There are so many people out there that are \nmis-ranked.  The fellow playing with Kelly last Sunday should not be a \n3.5...the woman we played against should not be a 3.5...Elise Shepherd should \nnot be a 4.5...and on and on.  I have heard through Roger White--Rice U's \nwomens coach and a USTA verifier--that they are slowly trying to rectify \nmis-rankings by looking more closely at league and tournament results.  I \nthink you may be the first casualty of this endeavor.\n\nBill Hunt has all sorts of counter-arguments.  He had Cheryl's approval to \nplay you in mixed at 4.0.  Maybe if we promise to play you with our weaker \n4.0 men--who are borderline 3.5 material--they'd let it pass.  Who knows.  If \nwe are going to lose you--and Chris after this week--we're going to be pretty \nweak, not to mention demoralized.\n\nAfter all, we're all just trying to have some fun on the tennis court.  \nSpeaking of which, this Sunday is Chris' last match before his big move to \nNorth Carolina.  We're out at Lee LeClear.  I don't remember if you or Bill \nare scheduled to play, but please join us for a little send-off celebration \nafter the match if you can.\n--sarah\n\n\n","headers":{"message-id":"<7136889.1075853300020.JavaMail.evans@thyme>","date":"Fri, 8 Jun 2001 02:04:00 -0700 (PDT)","from":"carol.clair@enron.com","to":"louderduck@aol.com","subject":"Re: Misc","mime-version":"1.0","content-type":"text/plain; charset=us-ascii","content-transfer-encoding":"7bit","x-from":"Carol St Clair","x-to":"LOUDERDUCK@aol.com@ENRON","x-cc":"","x-bcc":"","x-folder":"\\Carol_StClair_Nov2001\\Notes Folders\\Sent","x-origin":"StClair-C","x-filename":"cstclai.nsf"},"subject":"Re: Misc","messageId":"7136889.1075853300020.JavaMail.evans@thyme","priority":"normal","from":[{"address":"carol.clair@enron.com","name":""}],"to":[{"address":"louderduck@aol.com","name":""}],"date":"2001-06-08T09:04:00.000Z"}