{"text":"fyi\n----- Forwarded by Elizabeth Sager/HOU/ECT on 02/20/2001 02:20 PM -----\n\n\t\"JOHN G KLAUBERG\" <JKLAUBER@LLGM.COM>\n\t02/18/2001 05:46 PM\n\t\t \n\t\t To: Elizabeth.Sager@enron.com\n\t\t cc: \n\t\t Subject: MPLP PPA Dispute\n\n\n\nPRIVILEGED AND CONFIDENTIAL: ATTORNEY WORK PRODUCT\nDO NOT DISTRIBUTE\n\nElizabeth:\n\nI looked through the CMS PPA on my return flight to NY.  While I think we \nshould walk through the various contractual provisions over the phone, I \nnonetheless thought it might be of some help to set forth a few preliminary \nfocal points for those discussions, particularly if you don't get to this for \na few days.  I thought it made sense to contemporaneously record some \ncomments as I was thinking through some of the issues/positions.  Also, I'll \nhave to run down the conflict issue when I get back into the office, but I \nthought I could generally review the PPA in any event.\n\nIn addition, I did not know whether it was ENA's or Dynegy's obligation to \nwork on a response to CMS, but I thought it made some sense to see what one \nmight look like on paper.  (See  attached).  At this point, however, I'm not \nsure whether MPLP should furnish any specific contract-based rationale in \nwriting to CMS as to MPLP's position that the capacity charges should be \nadjusted on a calendar year basis.  You will note that the draft letter \nfocuses on the language dealing with the adjustment formula to the Contract \nCapacity Factor (which clearly is done on a calendar year basis), rather than \nthe scheduled changes to the stated capacity charges set forth on Exhibit D.  \nAs noted below, there are some issues underlying this position.\n\nPreliminary Overall Assessment\n\nThe PPA essentially is inconsistent on the capacity charge adjustment issue.  \nWhile many of the relevant computations are done on a calendar year \nbasis--which generally supports MPLP's position--the effect of adjusting the \nstated capacity charges on a calendar year basis results in two anomalies: \nnamely, the stated capacity charge (on Exhibit D) for \"Year 1\" only would \napply for 3 months, but even more importantly, the capacity charge (on \nExhibit D) for \"Year 35\" would apply for the last 21 months of the Contract \nTerm.  The anomaly \"running in the other direction\" is that, under CMS's \ninterpretation, various computations would be made on a calendar year basis \n(e.g., Contract Capacity Factor), and adjustments resulting therefrom would \nbe applied \"mid-stream\" (i.e., after 3 months of the alleged \"contract year\" \n).  My overall concern is that an arbitrator may focus on the anomaly \n(described above) that results by applying Exhibit D using a calendar year \nconcept (i.e., the 21 month \"Year 35\" issue) since that is a fairly easy \nconcept to get your arms around..\n\nMore Information/Diligence/Research\n\nBefore a definitive conclusion on the issue can be made, we likely would want \nto review or undertake, as the case may be, some additional \ninformation/diligence/research, such as (which I assume we could generally \nobtain from the Michigan regulatory counsel referenced in the e-mail you \nforwarded):\n\n--The Michigan PUC presumably approved the PPA (prior to the first amendment) \nin a published Order.  Was there anything in that Order or the submissions \n(or exhibits thereto, including financial projections) that might provide \nsome guidance?\n\n--My guess is that there must be other CMS QF PPAs with the same type of \npricing structure since this issue essentially would arise in every instance \nwhere the COD was not a Jan.1.  Do we (or local counsel) know whether this \nmay be a \"global\" attack by CMS on these types of PPAs?\n\n--While not directly relevant to the contract interpretation question, \nconfirm with local counsel that CMS would have recovered the \"excess\" \ncapacity payments from its customers--so that it presumably would have to \nissue a customer refund if it were to prevail on its claims.\n\n--CMS \"self bills\" itself under the PPA.  Has the statute of limitations run \non any of its claims for refunds for prior years?  Can CMS's prior course of \ndealing be used to support MPLP's contractual interpretation, or is there \notherwise an equitable argument that CMS should not be able to recover prior \n\"overpayments\" (as opposed to prospectively adjusting the capacity \npayments)?  (This could be particularly helpful to try to settle out the \ndispute on the basis that MPLP would concede the issue on a prospective basis \nonly).\n\n--The cover letter from CMS suggests that the alleged payment error resulted \nin payments in excess of the avoided cost rate authorized by the PUC.  Isn't \nthis determination to be made over the life of the PPA, rather than for any \nparticular period?  Assuming CMS's statement is correct, I assume it does not \naffect the validity of the PPA, but only whether CMS can recover the \"excess\" \namount in rates?\n\n--Do we have any leverage in the event we were to raise this dispute with the \nPUC?  If so, can this be used in the context of trying to work out an overall \nrestructuring of the PPA?\n\n\nCertain Points in Support of MPLP's Position\n\n--The definition of \"Contract Capacity Factor\" provides for a calendar year \ndetermination and, most importantly, provides for a partial year calculation \nfor the year in which the COD occurs that ends at the end of that calendar \nyear.  If the capacity charge should be adjusted as of the anniversary of the \nCOD date, it arguably would not make sense to have a partial year calculation.\n\n--Sec. 10(a) provides that if in any calendar year the Contract Capacity \nFactor is less than 60%, then the capacity charges set forth on Exhibit D \n\"shall be adjusted for the next calendar year as follows.... The capacity \ncharges for the following calendar year shall then be determined....  \n(Emphasis added).  This section makes specific reference to Exhibit D and \nmakes the adjustment effective for the next calendar year, not on the next \nanniversary of the COD.  It arguably would not appear to make any sense to \napply the Contract Capacity Factor adjustment on a calendar basis, but \ndetermine the capacity charges on a COD anniversary basis if no adjustments \nthereto are required because the Contract Capacity Factor levels do not \nrequire an adjustment.\n\n --NOTE:  The counter-argument, however, is that the foregoing language only \npertains to the computation of a percentage \"haircut\" or adjustment that is \napplied to the stated capacity charges on Exhibit D, whatever those may be, \nrather than to when the annual stated capacity charges are effective.  That \nis, making this adjustment on a calendar year basis, even though the \nscheduled capacity rates change each October 1, is not necessarily in \nconflict with the rest of the PPA.\n\n--Sec. 2(b) (Effective Date and Term) provides that the Agreement runs for 35 \nyears \"and thereafter from year to year,\" unless a party gives at least one \nyear's notice to terminate which termination shall be effective \"at the end \nof the 35 years or any calendar year thereafter.\" (Emphasis added).  Thus, \nfor example, if one month after the end of the 35 year term--i.e., October \n31, 2030--a party gave notice to terminate, such termination would be \neffective December 31, 2031, not September 30, 2031 or September 30, 2032 \n(i.e., not on the anniversary dates of the COD).  Thus, the PPA contemplates \nin certain respects certain \"stub\" years and certain \"long\" years, a \ncontractual scheme that is at least analogous to MPLP's position on the stub \nand long years for the timing of the scheduled changes in the stated capacity \ncharges on Exhibit D.\n\n--There are other calendar year based obligations--for e.g., Sec. 13 (and \nExhibit B) reflect termination payments that, again, are calculated on a \ncalendar year basis.  (We should discuss with the commercial people the \neconomic rationale underlying the termination payments to see if there may be \nadditional support in that respect).  (Note that some other calendar year \nbased calculations were eliminated by the First Amendment to the PPA, but can \nstill be used to reflect the underlying \"calendar year\" flavor of the PPA \nsince the issue at hand existed even prior to the First Amendment).\n\nA Few Additional Points to Note\n\n--The PPA is devoid of default language, LDs, etc.; however, MPLP could bring \na claim against CMS to arbitration (Sec. 18) for what it believes it is owed \nwhen CMS does not pay the full capacity charges in 2001 (plus interest as \nprovided at Sec. 20) and keep performing under the PPA.\n\n--Although I do not see a significant issue here, let's briefly discuss the \npotential for CMS to try to affirmatively use an \"indication\" of a regulatory \ndisallowance pursuant to Sec. 10(c) as a way to attempt to force its \n\"contract year\" interpretation of Exhibit D.  While Sec. 10(c) is one of \nthose \"old school\" one way regulatory outs, MPLP would undoubtedly use Sec. \n10(e) [requiring CMS to defend the PPA) to prevent CMS's affirmatively use of \nthe PUC to support its contract claim.  (In Pennsylvania, PECO, in an \nanalogous circumstance, attempted to use a PUC determination as justification \nto attempt to break a PPA with a QF).\n\nLet me know when you wish to follow up.\n\nJohn\n\n\n\n\"This e-mail, including attachments, contains information that is \nconfidential and it may be protected by the attorney/client or other \nprivileges.  This e-mail, including attachments, constitutes non-public \ninformation intended to be conveyed only to the designated recipient(s).  If \nyou are not an intended recipient, please delete this e-mail, including \nattachments and notify me by return mail, e-mail or by phone at 212 \n424-8125.  The unauthorized use, dissemination, distribution or reproduction \nof the e-mail, including attachments, is prohibited and may be unlawful.\n\nJohn Klauberg\nLeBoeuf, Lamb, Greene & MacRae, L.L.P.\n212 424-8125\njklauber@llgm.com\n - sager-2.doc","headers":{"message-id":"<17955338.1075859627047.JavaMail.evans@thyme>","date":"Tue, 20 Feb 2001 06:21:00 -0800 (PST)","from":"elizabeth.sager@enron.com","to":"marcus.nettelton@enron.com, richard.sanders@enron.com","subject":"MPLP PPA Dispute","mime-version":"1.0","content-type":"text/plain; charset=us-ascii","content-transfer-encoding":"7bit","x-from":"Elizabeth Sager","x-to":"Marcus Nettelton, Richard B Sanders","x-cc":"","x-bcc":"","x-folder":"\\Elizabeth_Sager_Jun2001\\Notes Folders\\Sent","x-origin":"Sager-E","x-filename":"esager.nsf"},"subject":"MPLP PPA Dispute","messageId":"17955338.1075859627047.JavaMail.evans@thyme","priority":"normal","from":[{"address":"elizabeth.sager@enron.com","name":""}],"to":[{"address":"marcus.nettelton@enron.com","name":""},{"address":"richard.sanders@enron.com","name":""}],"date":"2001-02-20T14:21:00.000Z"}