{"text":"Can you get me these two articles by Fri?\n----- Forwarded by Richard B Sanders/HOU/ECT on 09/28/2000 05:41 PM -----\n\n\t\"JOHN G KLAUBERG\" <JKLAUBER@LLGM.COM>\n\t09/28/2000 08:50 AM\n\t\t \n\t\t To: <Mark.E.Haedicke@enron.com>, <Richard.B.Sanders@enron.com>\n\t\t cc: \n\t\t Subject: California\n\n\nMark & Richard:  Since I have the benefit of reading the WSJ on my commute \ninto the City, I thought I would just let you know if you had not see it \nalready that there is a follow up article today to yesterday's article about \nthe tremendous losses being absorbed by PG&E and SoCalEd due to the spike in \nwholesale power prices.  The article today, not surprisingly, talks about the \nsignificant 3Q earnings that are anticipated to be reported by the \nunregulated generating companies (E.g., Reliant, NRG and Southern) that \npurchased the plants from PG&E and SoCalEd.  While this \"news\" is not \nunexpected, it nonetheless is the type of article that tends to excite \nconsumer advocates, politicians and regulators since it focuses on what it \ncalls the \"irony\" of the utilities now suffering huge losses (which \nultimately will be borne by consumers to some, and perhaps a large, extent) \nfrom having to buy power from assets they once owned.  Obviously, the concern \nis that the rhetoric overtakes a rational examination of the system.  I know \nthat each of you are following this situation very closely, but I thought I \nwould just drop you a quick note in any event.  John\n\n\"This e-mail, including attachments, contains information that is \nconfidential and it may be protected by the attorney/client or other \nprivileges.  This e-mail, including attachments, constitutes non-public \ninformation intended to be conveyed only to the designated recipient(s).  If \nyou are not an intended recipient, please delete this e-mail, including \nattachments and notify me by return mail, e-mail or by phone at 212 \n424-8125.  The unauthorized use, dissemination, distribution or reproduction \nof the e-mail, including attachments, is prohibited and may be unlawful.\n\nJohn Klauberg\nLeBoeuf, Lamb, Greene & MacRae, L.L.P.\n212 424-8125\njklauber@llgm.com\n","headers":{"message-id":"<19228844.1075853260697.JavaMail.evans@thyme>","date":"Thu, 28 Sep 2000 10:41:00 -0700 (PDT)","from":"richard.sanders@enron.com","to":"linda.guinn@enron.com","subject":"California","mime-version":"1.0","content-type":"text/plain; charset=us-ascii","content-transfer-encoding":"7bit","x-from":"Richard B Sanders","x-to":"Linda R Guinn","x-cc":"","x-bcc":"","x-folder":"\\Richard_Sanders_Oct2001\\Notes Folders\\Sent","x-origin":"Sanders-R","x-filename":"rsanders.nsf"},"subject":"California","messageId":"19228844.1075853260697.JavaMail.evans@thyme","priority":"normal","from":[{"address":"richard.sanders@enron.com","name":""}],"to":[{"address":"linda.guinn@enron.com","name":""}],"date":"2000-09-28T17:41:00.000Z"}