{"text":"you're right. wonder what the deal is? \n\ngot an email from Lu. he and bev have invited the mann's and the parker's for drinks friday night at the bayou bend towers. i will thank them but tell them we will be out of town.  \n\n-----Original Message-----\nFrom: Mann, Kay [mailto:Kay.Mann@ENRON.com]\nSent: Monday, November 19, 2001 11:21 AM\nTo: nmann@erac.com\nSubject: FW: Hi there!\n\n\n\nJust kinda seems like they could come in separate cars if they really\nwanted to spend some time...\n-----Original Message-----\nFrom: Lisa Clarke [mailto:lisa@casa-de-clarke.com]\nSent: Sunday, November 18, 2001 4:56 PM\nTo: Mann, Kay\nSubject: Hi there!\n\n\nHey! Sorry I missed your call. I was at the mall with the girls. (I\nreally\ndon't like to shop)  Bobby mentioned that Beverly's house will be\navailable\nover Thanksgiving. It'll be good to have the extra elbow room. Odds are\nthat\nBobby and I may still stay at the bed and breakfast, just because I like\nit\nso much. I feel so spoiled when I stay there.\n\nIt looks like we are just barely going to be able to be in Palacios.\nBobby\nis working Wednesday, so I think we are going to come in on Thursday. I\ngrimace at the thought of spending twice as much time just getting out\nof\nAustin. I think we'll get up and leave early on Thursday and try to get\nthere by late morning. Then of course we need to come back on Friday to\nBobby get ready to \"hop the pond\".\n\nWhat do we need to bring as far as plates, plastic silver ware and all\nthat\ngood stuff??? Of course we'll bring cokes and beer and stuff like that,\nbut\nwhat else is needed?\n\nWe'll also bring some smoked turkey and dressing for Thursday too. We\ncan\nhave a smorgasbord for our meal. And since we have access to Beverly's\nhouse, I can warm stuff up over there, so as not to get in anyone's way.\n\nI'm looking forward to seeing yall again. We are sorry we can't be there\nlonger, but we're glad to get to be there some.\n\nLet me know what else I need to bring....\n\nHope you've had a good weekend!\n\nLove,\nLisa\n\n\n**********************************************************************\nThis e-mail is the property of Enron Corp. and/or its relevant affiliate and may contain confidential and privileged material for the sole use of the intended recipient (s). Any review, use, distribution or disclosure by others is strictly prohibited. If you are not the intended recipient (or authorized to receive for the recipient), please contact the sender or reply to Enron Corp. at enron.messaging.administration@enron.com and delete all copies of the message. This e-mail (and any attachments hereto) are not intended to be an offer (or an acceptance) and do not create or evidence a binding and enforceable contract between Enron Corp. (or any of its affiliates) and the intended recipient or any other party, and may not be relied on by anyone as the basis of a contract by estoppel or otherwise. Thank you. \n**********************************************************************","headers":{"message-id":"<2400773.1075861729098.JavaMail.evans@thyme>","date":"Mon, 19 Nov 2001 09:30:23 -0800 (PST)","from":"nmann@erac.com","to":"kay.mann@enron.com","subject":"RE: Hi there!","mime-version":"1.0","content-type":"text/plain; charset=us-ascii","content-transfer-encoding":"7bit","x-from":"neil mann <nmann@erac.com>","x-to":"Mann, Kay </O=ENRON/OU=NA/CN=RECIPIENTS/CN=KMANN>","x-cc":"","x-bcc":"","x-folder":"\\KMANN (Non-Privileged)\\Mann, Kay\\Deleted Items","x-origin":"Mann-K","x-filename":"KMANN (Non-Privileged).pst"},"subject":"RE: Hi there!","messageId":"2400773.1075861729098.JavaMail.evans@thyme","priority":"normal","from":[{"address":"nmann@erac.com","name":""}],"to":[{"address":"kay.mann@enron.com","name":""}],"date":"2001-11-19T17:30:23.000Z"}